ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx270f256c.h
INLINE SFR_DATA _USB_DMINUS_PULLDN_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_DMPULDWN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_VBUS_LINE_PWRD_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_VBUSON_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_OTG_ENABLE_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_OTGEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_VBUS_CHARGE_PULLUP_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_VBUSCHG_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_VBUS_DISCHARGE_PULLDN_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_VBUSDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_ACTIVITY_PENDING_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_UACTPND_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_SLEEP_GUARD_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USLPGRD_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_MODULE_BUSY_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USBBUSY_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_IN_SUSPEND_MODE_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USUSPEND_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_POWERED_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USBPWR_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_UnIR_VAL_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1IR_STALLIF_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_UnIE_VAL_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1IE_STALLIE_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_UnEIR_VAL_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EIR_BTSEF_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_UnEIE_VAL_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EIE_BTSEE_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_LAST_ENDPOINT_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_ENDPT_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_LAST_DIRECTION_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_DIR_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_LAST_PING_PONG_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_PPBI_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_LIVE_JSTATE_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_JSTATE_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_LIVE_SE0_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_SE0_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_PACKET_XFER_DISABLED_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PKTDIS_TOKBUSY_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_BUSY_WITH_TOKEN_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PKTDIS_TOKBUSY_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_GENERATE_RESET_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBRST_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_HOST_ENABLE_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_HOSTEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_RESUME_SIGNALING_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_RESUME_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_FREEZE_BUFFERS_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PPBRST_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_DEVICE_ENABLE_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBEN_SOFEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_START_OF_FRAMES_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBEN_SOFEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_NEXT_TOKEN_LOWSPEED_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1ADDR_LSPDEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

