ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx270f256c.h
INLINE SFR_DATA _USB_DEVICE_ADDRESS_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1ADDR_DEVADDR_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_FRAME_NUMBER_7to0_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1FRML_FRML_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_FRAME_NUMBER_10to8_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1FRMH_FRMH_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_TOKEN_PID_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1TOK_PID_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_TOKEN_ENDPOINT_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1TOK_EP_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_SOF_COUNT_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1SOF_CNT_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_BDT_BASE_ADDR_15to09_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1BDTP1_BDTPTRL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_BDT_BASE_ADDR_23to16_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1BDTP2_BDTPTRH_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_BDT_BASE_ADDR_31to24_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1BDTP3_BDTPTRU_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EYE_PATTERN_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CNFG1_UTEYE_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_STOP_IN_IDLE_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CNFG1_USBSIDL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_AUTO_SUSPEND_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CNFG1_UASUSPND_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP0_LOW_SPEED_CONNECT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_LSPD_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP0_NO_RETRY_NAKS_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_RETRYDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP0_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP0_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP0_XMIT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP0_XMIT_ON_EN_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP0_STALL_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPSTALL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP0_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP1_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP1_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP1_XMIT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP1_STALL_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPSTALL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP1_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP2_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP2_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP2_XMIT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP2_STALL_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPSTALL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP2_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP3_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP3_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

