ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx270f256c.h
INLINE SFR_DATA _USB_EP7_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP7_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP7_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP7_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP8_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP8_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP8_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP8_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP8_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP9_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP9_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP9_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP9_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP9_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP9_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP9_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP9_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP9_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP9_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP10_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP10_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP10_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP10_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP10_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP10_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP10_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP10_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP10_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP10_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP11_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP11_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP11_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP11_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP11_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP12_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_EP12_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

