ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx270f256c.h
INLINE_API bool PLIB_USB_ExistsLastTransactionDetails(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsLastTransactionDetails_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_JStateIsActive(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_JStateIsActive_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_ExistsLiveJState(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsLiveJState_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_SE0InProgress(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_SE0InProgress_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_ExistsLiveSingleEndedZero(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsLiveSingleEndedZero_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_PacketTransferIsDisabled(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_PacketTransferIsDisabled_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_PacketTransferEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_PacketTransferEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_PacketTransferDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_PacketTransferDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsPacketTransfer(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsPacketTransfer_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_IsBusyWithToken(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_IsBusyWithToken_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_ExistsHostBusyWithToken(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsHostBusyWithToken_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_ResetSignalEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_ResetSignalEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_ResetSignalDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_ResetSignalDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsHostGeneratesReset(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsHostGeneratesReset_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_OperatingModeSelect(USB_MODULE_ID index, USB_OPMODES opMode)
{
    switch (index) {
        case USB_ID_1 :
            USB_OperatingModeSelect_Default(index, opMode);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsOpModeSelect(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOpModeSelect_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_ResumeSignalingEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_ResumeSignalingEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_ResumeSignalingDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_ResumeSignalingDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsResumeSignaling(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsResumeSignaling_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_PingPongFreeze(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_PingPongFreeze_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_PingPongUnfreeze(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_PingPongUnfreeze_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_PingPongReset(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_PingPongReset_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsBufferFreeze(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsBufferFreeze_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_SOFEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_SOFEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_SOFDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_SOFDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

