ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx270f256c.h
INLINE_API void PLIB_USB_StopInIdleEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_StopInIdleEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_StopInIdleDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_StopInIdleDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsStopInIdle(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsStopInIdle_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_AutoSuspendDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_AutoSuspendDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_AutoSuspendEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_AutoSuspendEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsAutomaticSuspend(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsAutomaticSuspend_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_PingPongModeSelect(USB_MODULE_ID index, USB_PING_PONG_MODE ppConfig)
{
    switch (index) {
        case USB_ID_1 :
            USB_PingPongModeSelect_Unsupported(index, ppConfig);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API USB_PING_PONG_MODE _PLIB_UNSUPPORTED PLIB_USB_PingPongModeGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_PingPongModeGet_Unsupported(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_PING_PONG_MODE)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_USB_ExistsPingPongMode(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsPingPongMode_Unsupported(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_UOEMonitorEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_UOEMonitorEnable_Unsupported(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_UOEMonitorDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_UOEMonitorDisable_Unsupported(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_USB_ExistsUOEMonitor(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsUOEMonitor_Unsupported(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_OnChipPullUpEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_OnChipPullUpEnable_Unsupported(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_OnChipPullUpDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_OnChipPullUpDisable_Unsupported(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_USB_ExistsOnChipPullup(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOnChipPullup_Unsupported(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_TransceiverEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_TransceiverEnable_Unsupported(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_TransceiverDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_TransceiverDisable_Unsupported(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_USB_ExistsOnChipTransceiver(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOnChipTransceiver_Unsupported(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_FullSpeedEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_FullSpeedEnable_Unsupported(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_FullSpeedDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_FullSpeedDisable_Unsupported(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_USB_ExistsSpeedControl(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsSpeedControl_Unsupported(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_EP0LSDirectConnectEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_EP0LSDirectConnectEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EP0LSDirectConnectDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_EP0LSDirectConnectDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsEP0LowSpeedConnect(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsEP0LowSpeedConnect_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_EP0NakRetryEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_EP0NakRetryEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EP0NakRetryDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_EP0NakRetryDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

